/*##############################################################################
 * 文件：DuiLoginWaitWnd.cpp
 * 描述：登录等待窗口实现
 * 作者：Teck
 * 时间：2018年5月24日
 * 版权：Copyright(C) 2018 Fsmeeting.com. All rights reserved.
 ##############################################################################*/
#include "stdafx.h"
#include "DuiLoginWaitWnd.h"
#include "SdkManager.h"
#include "define.h"

/*------------------------------------------------------------------------------
 * 描  述：构造函数
 * 参  数：无
 * 返回值：无
------------------------------------------------------------------------------*/
CDuiLoginWaitWnd::CDuiLoginWaitWnd()
{
}

/*------------------------------------------------------------------------------
 * 描  述：析构函数
 * 参  数：无
 * 返回值：无
------------------------------------------------------------------------------*/
CDuiLoginWaitWnd::~CDuiLoginWaitWnd()
{

}

/*------------------------------------------------------------------------------
 * 描  述：虚拟函数，DUI调用获取窗口xml布局文件目录
 * 参  数：无
 * 返回值：xml布局文件目录
 ------------------------------------------------------------------------------*/
CDuiString CDuiLoginWaitWnd::GetSkinFolder()
{
	return CDuiString(L"skin");
}

/*------------------------------------------------------------------------------
 * 描  述：虚拟函数，DUI调用获取窗口xml布局文件名称
 * 参  数：无
 * 返回值：xml布局文件名称
 ------------------------------------------------------------------------------*/
CDuiString CDuiLoginWaitWnd::GetSkinFile()
{
	return CDuiString(L"logining.xml");
}

/*------------------------------------------------------------------------------
 * 描  述：虚拟函数，DUI调用获取窗口类名称
 * 参  数：无
 * 返回值：窗口类名称
 ------------------------------------------------------------------------------*/
LPCTSTR CDuiLoginWaitWnd::GetWindowClassName(void) const
{
	return L"CDuiLoginWaitWnd";
}

/*------------------------------------------------------------------------------
 * 描  述：主要用来设置应用程序图标
 * 参  数：无
 * 返回值：无
 ------------------------------------------------------------------------------*/
void CDuiLoginWaitWnd::InitWindow()
{
	SetIcon(IDI_FSPCLIENT);
}

/*------------------------------------------------------------------------------
 * 描  述：窗口销毁处理
 * 参  数：略
 * 返回值：LRESULT
 ------------------------------------------------------------------------------*/
LRESULT CDuiLoginWaitWnd::OnDestroy(UINT, WPARAM, LPARAM, BOOL& bHandled)
{
	PostQuitMessage(0);
	return 0;
}